kubernetes/tutorial.org
#+SETUPFILE: ../org-html-themes/setup/theme-readtheorg.setup
* Install minikube (on Windows)
** Minikube installation
   #+begin_src sh
     # Install chocolatey as package manager on Windows
     # Copy and paste the following string into your powershell(opened as admin)
     Set-ExecutionPolicy Bypass -Scope Process -Force; iex ((New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1'))

     # Install minikube
     # (Currently I have to use 0.25.2 version to avoid 'start cluster components...' hang problem)
     choco install minikube --version 0.25.2 -y
     # It should automatically install the dependency which is kubernetes-cli
     # if not, install
     choco install kubernetes cli -y

   #+end_src
** Start minikube 
*** Configure hyper-v as vm to be used with minikube
    1) Enable hyperv on Windows10
    2) Create external virtual switch on hyperv (name it like "minikube-switch", its name will be used later).
*** Start minikube
    1) cd into the drive you installed minikube
       If you installed minikube in C:, then execute the following command in drive C:. Otherwise, it may cause strange problem.
    2) check the start options with =minikube start --help=. I use the following command
       #+begin_src sh
	 minikube start --vm-driver "hyperv" --hyperv-virtual-switch "minikube-switch" --memory 4096
       #+end_src
* Prepare your docker image
  Create hellonode folder, prepare your Dockerfile and related file for creating docker image in that folder.
** Create and edit .js in hellonode folder
   #+begin_src javascript
     const http = require('http');
     const os = require('os');
     console.log("Kubia server starting...");
     var handler = function(request, response) {
	 console.log("Received request from " + request.connection.remoteAddress);
	 response.writeHead(200);
	 response.end("You've hit " + os.hostname() + "\n");
     };
     var www = http.createServer(handler);
     www.listen(8080);
   #+end_src
** Create and edit Dockerfile
   #+begin_src dockerfile
	     FROM node:7
	     ADD app.js /app.js
	     ENTRYPOINT ["node", "app.js"]
   #+end_src
** Running the container image 
   #+begin_src sh
     # To build docker image
     docker build -t zwpdbh/kubia .

     # To check your images
     docker images

     # To run your image
     docker run --name kubia-container -p 8080:8080 -d zwpdbh/kubia

     # To push your image(You need to push it into registry so that the image could be downloaded by Docker daemon in minikube)
     docker push zwpdbh/kubia:<tag>
   #+end_src 
   After running those, you should visit your [[http://localhost:8080/][http://localhost:8080/]] see something like "You have hit e0ad663b88fc".
   
** (Build and Run docker image in minikube)
   To store images inside minikube(otherwise we need to push images onto Web, and let minikube's vm loadload those image during container creation), we will not use local machine's Docker registry. We will use the Docker registry of the Docker daemon running inside minikube's vm instance.
   #+begin_src sh
     # set to use minikube's docker daemon
     minikube docker-env | Invoke-Expression

     # build your docker image (and other stuff)
     docker build -t hello-node:v1 .

     # check that the image is in minikube's registry
     minikube ssh docker images
   #+end_src
   # Later, when you no longer wish to use the Minikube host, you can undo this change by running
   # #+begin_src sh
   #   # for linux
   #   eval $(minikube docker-env -u)

   #   # for windows
   #   minikube docker-env -u
   # #+end_src
* Running your first app on kubernetes
  Instead of running docker container by yourself, you let kubernetes to create and manages containers. However, kubernetes does not operate directly on containers. It operate on pods which are the building blocks for kubernetes.
