kubernetes/tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-18 Thu 13:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf6ed225">1. Install minikube (on Windows)</a>
<ul>
<li><a href="#org9866433">1.1. Minikube installation</a></li>
<li><a href="#org63eae1a">1.2. Start minikube</a>
<ul>
<li><a href="#org4ee1e7a">1.2.1. Configure hyper-v as vm to be used with minikube</a></li>
<li><a href="#orge9ea05d">1.2.2. Start minikube</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0048f13">2. Prepare your docker image</a>
<ul>
<li><a href="#org44051ed">2.1. Create and edit .js in hellonode folder</a></li>
<li><a href="#orgfc172ce">2.2. Create and edit Dockerfile</a></li>
<li><a href="#org806007b">2.3. Running the container image</a></li>
<li><a href="#orgc6aedbf">2.4. (Build and Run docker image in minikube)</a></li>
</ul>
</li>
<li><a href="#orgdcb58b0">3. Running your first app on kubernetes</a>
<ul>
<li><a href="#orgf60185a">3.1. Deploying your Node.js app</a></li>
</ul>
</li>
<li><a href="#org7417982">4. Create a Service object</a>
<ul>
<li><a href="#org813f267">4.1. Things to notice if you are using minikube to check the services</a></li>
<li><a href="#orgd0ea6f0">4.2. Update your App</a></li>
</ul>
</li>
<li><a href="#org8550014">5. Enable addons</a></li>
<li><a href="#org87a9a05">6. Clean up</a>
<ul>
<li><a href="#org19c399d">6.1. Clean up kubernetes resources</a></li>
<li><a href="#orgad92772">6.2. Clean up docker</a></li>
</ul>
</li>
<li><a href="#orgd0c887f">7. Troubleshooting</a>
<ul>
<li><a href="#org4ac4acb">7.1. About error shows need virtual box</a>
<ul>
<li><a href="#orgc416234">7.1.1. Problem description</a></li>
<li><a href="#org79498f3">7.1.2. Solution</a></li>
</ul>
</li>
<li><a href="#orge616ba9">7.2. About error about network adaptor is not visible</a>
<ul>
<li><a href="#orgb0f599c">7.2.1. Problem description</a></li>
<li><a href="#org948d22c">7.2.2. Solution</a></li>
</ul>
</li>
<li><a href="#orged0b6b0">7.3. About hang at "minikube start"</a>
<ul>
<li><a href="#org3f9b4a4">7.3.1. Problem description</a></li>
<li><a href="#orgbe0fb9d">7.3.2. solution</a></li>
</ul>
</li>
<li><a href="#orgd445822">7.4. About Pod Remains in ContainerCreating status</a>
<ul>
<li><a href="#org58203ec">7.4.1. Problem description</a></li>
<li><a href="#org1e75473">7.4.2. Exlaination</a></li>
<li><a href="#org4039409">7.4.3. Solution one</a></li>
<li><a href="#org2dbe8c5">7.4.4. Solution two</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf6ed225" class="outline-2">
<h2 id="orgf6ed225"><span class="section-number-2">1</span> Install minikube (on Windows)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9866433" class="outline-3">
<h3 id="org9866433"><span class="section-number-3">1.1</span> Minikube installation</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Install chocolatey as package manager on Windows</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Copy and paste the following string into your powershell(opened as admin)</span>
Set-ExecutionPolicy Bypass -Scope Process -Force; iex ((New-Object System.Net.WebClient).DownloadString(<span style="color: #2d9574;">'https://chocolatey.org/install.ps1'</span>))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Install minikube</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">(Currently I have to use 0.25.2 version to avoid 'start cluster components...' hang problem)</span>
choco install minikube --version 0.25.2 -y
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">It should automatically install the dependency which is kubernetes-cli</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if not, install</span>
choco install kubernetes cli -y

</pre>
</div>
</div>
</div>
<div id="outline-container-org63eae1a" class="outline-3">
<h3 id="org63eae1a"><span class="section-number-3">1.2</span> Start minikube</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4ee1e7a" class="outline-4">
<h4 id="org4ee1e7a"><span class="section-number-4">1.2.1</span> Configure hyper-v as vm to be used with minikube</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>Enable hyperv on Windows10</li>
<li>Create external virtual switch on hyperv (name it like "minikube-switch", its name will be used later).</li>
</ol>
</div>
</div>
<div id="outline-container-orge9ea05d" class="outline-4">
<h4 id="orge9ea05d"><span class="section-number-4">1.2.2</span> Start minikube</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>cd into the drive you installed minikube
If you installed minikube in C:, then execute the following command in drive C:. Otherwise, it may cause strange problem.</li>
<li><p>
check the start options with <code>minikube start --help</code>. I use the following command
</p>
<div class="org-src-container">
<pre class="src src-sh">minikube start --vm-driver <span style="color: #2d9574;">"hyperv"</span> --hyperv-virtual-switch <span style="color: #2d9574;">"minikube-switch"</span> --memory 4096
</pre>
</div></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org0048f13" class="outline-2">
<h2 id="org0048f13"><span class="section-number-2">2</span> Prepare your docker image</h2>
<div class="outline-text-2" id="text-2">
<p>
Create hellonode folder, prepare your Dockerfile and related file for creating docker image in that folder.
</p>
</div>
<div id="outline-container-org44051ed" class="outline-3">
<h3 id="org44051ed"><span class="section-number-3">2.1</span> Create and edit .js in hellonode folder</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">http</span> = require(<span style="color: #2d9574;">'http'</span>);
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">os</span> = require(<span style="color: #2d9574;">'os'</span>);
console.log(<span style="color: #2d9574;">"Kubia server starting..."</span>);
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">handler</span> = <span style="color: #4f97d7; font-weight: bold;">function</span>(<span style="color: #7590db;">request</span>, <span style="color: #7590db;">response</span>) {
    console.log(<span style="color: #2d9574;">"Received request from "</span> + request.connection.remoteAddress);
    response.writeHead(200);
    response.end(<span style="color: #2d9574;">"You've hit "</span> + os.hostname() + <span style="color: #2d9574;">"\n"</span>);
};
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">www</span> = http.createServer(handler);
www.listen(8080);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc172ce" class="outline-3">
<h3 id="orgfc172ce"><span class="section-number-3">2.2</span> Create and edit Dockerfile</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #4f97d7; font-weight: bold;">FROM</span> <span style="color: #ce537a; font-weight: bold;">node:7</span>
<span style="color: #4f97d7; font-weight: bold;">ADD</span> app.js /app.js
<span style="color: #4f97d7; font-weight: bold;">ENTRYPOINT</span> [<span style="color: #2d9574;">"node"</span>, <span style="color: #2d9574;">"app.js"</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-org806007b" class="outline-3">
<h3 id="org806007b"><span class="section-number-3">2.3</span> Running the container image</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">To build docker image</span>
docker build -t zwpdbh/kubia .

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">To check your images</span>
docker images

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">To run your image</span>
docker run --name kubia-container -p 8080:8080 -d zwpdbh/kubia

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">To push your image(You need to push it into registry so that the image could be downloaded by Docker daemon in minikube)</span>
docker push zwpdbh/kubia:&lt;tag&gt;
</pre>
</div>
<p>
After running those, you should visit your <a href="http://localhost:8080/">http://localhost:8080/</a> see something like "You have hit e0ad663b88fc".
</p>
</div>
</div>

<div id="outline-container-orgc6aedbf" class="outline-3">
<h3 id="orgc6aedbf"><span class="section-number-3">2.4</span> (Build and Run docker image in minikube)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
To store images inside minikube(otherwise we need to push images onto Web, and let minikube's vm loadload those image during container creation), we will not use local machine's Docker registry. We will use the Docker registry of the Docker daemon running inside minikube's vm instance.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">set to use minikube's docker daemon</span>
minikube docker-env | Invoke-Expression

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">build your docker image (and other stuff)</span>
docker build -t hello-node:v1 .

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">check that the image is in minikube's registry</span>
minikube ssh docker images
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdcb58b0" class="outline-2">
<h2 id="orgdcb58b0"><span class="section-number-2">3</span> Running your first app on kubernetes</h2>
<div class="outline-text-2" id="text-3">
<p>
Instead of running docker container by yourself, you let kubernetes to create and manages containers. However, kubernetes does not operate directly on containers. It operate on pods which are the building blocks for kubernetes.
</p>
</div>
