kubernetes/tutorial.org
** Deploying your Node.js app 
   #+begin_src sh
     # create a deployment that manages a pod (it will use ReplicationController, rc)
     kubectl run hello-node --image=zwpdbh/kubia --port=8080 --generator=run/v1
     # without rc, it will create a deployment pod
     kubectl run hello-node --image=zwpdbh/kubia --port=8080
     # To specify use local images and not download images 
     kubectl run hello-node --image=hello-node:v1 --port=8080 --image-pull-policy=Never


     # view the pod (you can't list individual containers, since they are not standalone kubernetes objects)
     # It will take a while for container creation
     kubectl get pods
     # To get more details of a specific pod
     kubectl describe pod <pod_name>

     # check log of pod (could get from `kubectl get pods`)
     kubectl logs <pod-name>

     # view the deployment
     kubectl get deployments

     # view cluste events
     kubectl get events

     # view kubectl configuration
     kubectl config view
   #+end_src 
* Create a Service object
  Each pod created in the cluster gain a unique IP and could talk to each other, but it is by default private and could not be accessed from outside. So to be able to access you application, you need to create a service object.
  #+begin_src sh
    # Tell the rc to expose  the pod to the public
    kubectl expose rc hello-node --type=LoadBalancer --name hello-world-http
    # Tell the deployment controller to create a service
    kubectl expose deployment hello-node --type=LoadBalancer --name hello-world-http

    # View the service
    kubectl get services

    # Access your application (LoadBlancer type makes the Service accessible through the minikube service command)
    minikube service hello-node
  #+end_src
** Things to notice if you are using minikube to check the services
   1) If you are psing minikube, you don't get an external IP address. The external IP address remains in the pending state.
      You have to use =--type=NodePort= option instead of --type=LoadBalancer.
      #+begin_src sh
	kubectl expose deployment hello-node --type=NodePort --name hello-world-http
      #+end_src
   2) enter these commands
      #+begin_src sh
	kubectl cluster-info
	kubectl describe services <your_service_name>
      #+end_src
      Their output displays the IP address of your minikube node and the node port value for your services. Then enter this command to access your application.
      #+begin_src sh
	curl <minikube-node-ip-address>:<service-node-port>
      #+end_src
      For example:
      #+begin_src sh
	PS C:\Users\ntpriv> kubectl cluster-info
	Kubernetes master is running at https://10.3.11.19:8443

	PS C:\Users\ntpriv> kubectl describe services example-service
	Name:                     example-service
	Namespace:                default
	Labels:                   run=load-balancer-example
	Annotations:              <none>
	Selector:                 run=load-balancer-example
	Type:                     NodePort
	IP:                       10.96.224.169
	Port:                     <unset>  8080/TCP
	TargetPort:               8080/TCP
	NodePort:                 <unset>  31379/TCP
	Endpoints:                172.17.0.5:8080,172.17.0.6:8080
	Session Affinity:         None
	External Traffic Policy:  Cluster
	Events:                   <none>

	PS C:\Users\ntpriv> curl 10.3.11.19:31379


	StatusCode        : 200
	StatusDescription : OK
	Content           : {72, 101, 108, 108...}
	RawContent        : HTTP/1.1 200 OK
	Connection: keep-alive
	Transfer-Encoding: chunked
	Date: Wed, 17 Oct 2018 10:04:50 GMT

	Hello Kubernetes!
	Headers           : {[Connection, keep-alive], [Transfer-Encoding, chunked], [Date, Wed, 17 Oct 2018 10:04:50 GMT]}
	RawContentLength  : 17
      #+end_src
** Update your App 
   Before update, use the above command shows:
   #+begin_src sh
     PS D:\workdir\code\kubernetes_playground\hellonode> curl 10.3.11.19:32605


     StatusCode        : 200
     StatusDescription : OK
     Content           : {72, 101, 108, 108...}
     RawContent        : HTTP/1.1 200 OK
     Connection: keep-alive
     Transfer-Encoding: chunked
     Date: Thu, 18 Oct 2018 03:25:38 GMT

     Hello World!
     Headers           : {[Connection, keep-alive], [Transfer-Encoding, chunked], [Date, Thu, 18 Oct 2018 03:25:38 GMT]}
     RawContentLength  : 12
   #+end_src

   Edit your .js file
   #+begin_src sh
     response.end('Hello World! Again!');
   #+end_src

   Build a new version of your image
   #+begin_src sh
     docker build -t hello-node:v2 .
   #+end_src

   Update the image of your deployment
   #+begin_src sh
     # hello-node is the name you defined when "kubectl run hello-node ..."
     kubectl set image deployment/hello-node hello-node=hello-node:v2
   #+end_src

   The kubenetes could live update the application!
   #+begin_src sh
     PS D:\workdir\code\kubernetes_playground\hellonode> kubectl set image deployment/hello-node hello-node=hello-node:v2
     deployment.apps "hello-node" image updated
     PS D:\workdir\code\kubernetes_playground\hellonode> curl 10.3.11.19:32605


     StatusCode        : 200
     StatusDescription : OK
     Content           : {72, 101, 108, 108...}
     RawContent        : HTTP/1.1 200 OK
     Connection: keep-alive
     Transfer-Encoding: chunked
     Date: Thu, 18 Oct 2018 03:28:19 GMT

     Hello World! Again!
     Headers           : {[Connection, keep-alive], [Transfer-Encoding, chunked], [Date, Thu, 18 Oct 2018 03:28:19 GMT]}
     RawContentLength  : 19
   #+end_src 
* Enable addons
  To check the currently supported addons:
  #+begin_src sh
    minikube addons list
  #+end_src

  To enable some addon
  #+begin_src sh
    minikube addons enable <addon-name>

    PS D:\download\my_emacs_configuration> minikube addons enable dashboard
    dashboard was successfully enabled
    PS D:\download\my_emacs_configuration> minikube addons enable heapster
    heapster was successfully enabled
  #+end_src
  
* Clean up
