kubernetes/tutorial.html
<div id="outline-container-orgf60185a" class="outline-3">
<h3 id="orgf60185a"><span class="section-number-3">3.1</span> Deploying your Node.js app</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">create a deployment that manages a pod (it will use ReplicationController, rc)</span>
kubectl run hello-node --image=zwpdbh/kubia --port=8080 --generator=run/v1
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">without rc, it will create a deployment pod</span>
kubectl run hello-node --image=zwpdbh/kubia --port=8080
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">To specify use local images and not download images </span>
kubectl run hello-node --image=hello-node:v1 --port=8080 --image-pull-policy=Never


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">view the pod (you can't list individual containers, since they are not standalone kubernetes objects)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">It will take a while for container creation</span>
kubectl get pods
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">To get more details of a specific pod</span>
kubectl describe pod &lt;pod_name&gt;

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">check log of pod (could get from `kubectl get pods`)</span>
kubectl logs &lt;pod-name&gt;

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">view the deployment</span>
kubectl get deployments

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">view cluste events</span>
kubectl get events

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">view kubectl configuration</span>
kubectl config view
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7417982" class="outline-2">
<h2 id="org7417982"><span class="section-number-2">4</span> Create a Service object</h2>
<div class="outline-text-2" id="text-4">
<p>
Each pod created in the cluster gain a unique IP and could talk to each other, but it is by default private and could not be accessed from outside. So to be able to access you application, you need to create a service object.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Tell the rc to expose  the pod to the public</span>
kubectl expose rc hello-node --type=LoadBalancer --name hello-world-http
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Tell the deployment controller to create a service</span>
kubectl expose deployment hello-node --type=LoadBalancer --name hello-world-http

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View the service</span>
kubectl get services

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Access your application (LoadBlancer type makes the Service accessible through the minikube service command)</span>
minikube service hello-node
</pre>
</div>
</div>
<div id="outline-container-org813f267" class="outline-3">
<h3 id="org813f267"><span class="section-number-3">4.1</span> Things to notice if you are using minikube to check the services</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><p>
If you are psing minikube, you don't get an external IP address. The external IP address remains in the pending state.
You have to use <code>--type=NodePort</code> option instead of &#x2013;type=LoadBalancer.
</p>
<div class="org-src-container">
<pre class="src src-sh">kubectl expose deployment hello-node --type=NodePort --name hello-world-http
</pre>
</div></li>
<li><p>
enter these commands
</p>
<div class="org-src-container">
<pre class="src src-sh">kubectl cluster-info
kubectl describe services &lt;your_service_name&gt;
</pre>
</div>
<p>
Their output displays the IP address of your minikube node and the node port value for your services. Then enter this command to access your application.
</p>
<div class="org-src-container">
<pre class="src src-sh">curl &lt;minikube-node-ip-address&gt;:&lt;service-node-port&gt;
</pre>
</div>
<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-sh">PS C:\Users\ntpriv&gt; kubectl cluster-info
Kubernetes master is running at https://10.3.11.19:8443

PS C:\Users\ntpriv&gt; kubectl describe services example-service
Name:                     example-service
Namespace:                default
Labels:                   <span style="color: #7590db;">run</span>=load-balancer-example
Annotations:              &lt;none&gt;
Selector:                 <span style="color: #7590db;">run</span>=load-balancer-example
Type:                     NodePort
IP:                       10.96.224.169
Port:                     &lt;unset&gt;  8080/TCP
TargetPort:               8080/TCP
NodePort:                 &lt;unset&gt;  31379/TCP
Endpoints:                172.17.0.5:8080,172.17.0.6:8080
Session Affinity:         None
External Traffic Policy:  Cluster
Events:                   &lt;none&gt;

PS C:\Users\ntpriv&gt; curl 10.3.11.19:31379


StatusCode        : 200
StatusDescription : OK
Content           : {72, 101, 108, 108...}
RawContent        : HTTP/1.1 200 OK
Connection: keep-alive
Transfer-Encoding: chunked
Date: Wed, 17 Oct 2018 10:04:50 GMT

Hello Kubernetes!
Headers           : {[Connection, keep-alive], [Transfer-Encoding, chunked], [Date, Wed, 17 Oct 2018 10:04:50 GMT]}
RawContentLength  : 17
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-orgd0ea6f0" class="outline-3">
<h3 id="orgd0ea6f0"><span class="section-number-3">4.2</span> Update your App</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Before update, use the above command shows:
</p>
<div class="org-src-container">
<pre class="src src-sh">PS D:\workdir\code\kubernetes_playground\hellonode&gt; curl 10.3.11.19:32605


StatusCode        : 200
StatusDescription : OK
Content           : {72, 101, 108, 108...}
RawContent        : HTTP/1.1 200 OK
Connection: keep-alive
Transfer-Encoding: chunked
Date: Thu, 18 Oct 2018 03:25:38 GMT

Hello World!
Headers           : {[Connection, keep-alive], [Transfer-Encoding, chunked], [Date, Thu, 18 Oct 2018 03:25:38 GMT]}
RawContentLength  : 12
</pre>
</div>

<p>
Edit your .js file
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #bc6ec5; font-weight: bold;">response.end</span>(<span style="color: #2d9574;">'Hello World! Again!'</span>);
</pre>
</div>

<p>
Build a new version of your image
</p>
<div class="org-src-container">
<pre class="src src-sh">docker build -t hello-node:v2 .
</pre>
</div>

<p>
Update the image of your deployment
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">hello-node is the name you defined when "kubectl run hello-node ..."</span>
kubectl set image deployment/hello-node hello-node=hello-node:v2
</pre>
</div>

<p>
The kubenetes could live update the application!
</p>
<div class="org-src-container">
<pre class="src src-sh">PS D:\workdir\code\kubernetes_playground\hellonode&gt; kubectl set image deployment/hello-node hello-node=hello-node:v2
deployment.apps <span style="color: #2d9574;">"hello-node"</span> image updated
PS D:\workdir\code\kubernetes_playground\hellonode&gt; curl 10.3.11.19:32605


StatusCode        : 200
StatusDescription : OK
Content           : {72, 101, 108, 108...}
RawContent        : HTTP/1.1 200 OK
Connection: keep-alive
Transfer-Encoding: chunked
Date: Thu, 18 Oct 2018 03:28:19 GMT

Hello World! Again!
Headers           : {[Connection, keep-alive], [Transfer-Encoding, chunked], [Date, Thu, 18 Oct 2018 03:28:19 GMT]}
RawContentLength  : 19
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8550014" class="outline-2">
<h2 id="org8550014"><span class="section-number-2">5</span> Enable addons</h2>
<div class="outline-text-2" id="text-5">
<p>
To check the currently supported addons:
</p>
<div class="org-src-container">
<pre class="src src-sh">minikube addons list
</pre>
</div>

<p>
To enable some addon
</p>
<div class="org-src-container">
<pre class="src src-sh">minikube addons enable &lt;addon-name&gt;

PS D:\download\my_emacs_configuration&gt; minikube addons enable dashboard
dashboard was successfully enabled
PS D:\download\my_emacs_configuration&gt; minikube addons enable heapster
heapster was successfully enabled
</pre>
</div>
</div>
</div>
