kubernetes/tutorial.org
** Clean up kubernetes resources
   Delete service object
   #+begin_src sh
     kubectl delete service <service-name>
   #+end_src

   Delete pods, need to specify the controller type
   #+begin_src sh
     # If it is a ReplicationController
     kubectl delete rc hello-node

     # If it is deployment controller
     kubectl delete deployment hello-node
   #+end_src

   Stop and delete minikube VM
   #+begin_src sh
     # Stop minikube
     minikube stop 

     # Delete minikube VM
     minikube delete
   #+end_src
** Clean up docker
    #+begin_src sh
      #listing all running containers
      docker ps -a

      #getting additional information about a container 
      docker inspect <container-name>

      #running a shell inside an existing container 
      docker exec -it kubia-container bash

      #shot all container
      docker stop $(docker ps | awk '{print $NF}' | grep -v 'NAMES')

      #delte all containers
      docker rm -v $(docker ps -aq)

      #delete all docker images
      docker rmi $(docker images -q)
    #+end_src
* Troubleshooting
  (encountered problems)
** About error shows need virtual box
*** Problem description 
    Something like you need virtual box...
*** Solution
    When run =minikube start=, specify =--vm-driver "hyperv"=.
** About error about network adaptor is not visible
*** Problem description
    Error like network adaptor is not visible.
*** Solution
    Check if you created external virtual switch, and specify it with =--hyperv-virtual-switch "<switch-name>"= during start minikube.
** About hang at "minikube start"
*** Problem description
    When I use the latest version of minikube, say 0.30.0, and run =minikube start=, it hangs at the stage:"start cluster components...".
    When run =minikube logs -v 9=, the log shows something like:
    #+begin_src sh
      I1011 10:24:04.073426    2160 round_trippers.go:386] curl -k -v -XGET  -H "User-Agent: minikube.exe/v0.0.0 (windows/amd64) kubernetes/$Format" -H "Accept: application/json, */*" 'https://134.244.221.171:8443/api/v1/namespaces/kube-system/pods?labelSelector=k8s-app%3Dkube-proxy'
							   I1011 10:24:05.073974    2160 round_trippers.go:405] GET https://134.244.221.171:8443/api/v1/namespaces/kube-system/pods?labelSelector=k8s-app%3Dkube-proxy  in 1002 milliseconds
														I1011 10:24:05.073974    2160 round_trippers.go:411] Response Headers:
																				     I1011 10:24:05.075960    2160 kubernetes.go:119] error getting Pods with label selector "k8s-app=kube-proxy" [Get https://134.244.221.171:8443/api/v1/namespaces/kube-system/pods?labelSelector=k8s-app%3Dkube-proxy: dial tcp 134.244.221.171:8443: connectex: No connection could be nmade because the target machine actively refused it.]
    #+end_src
*** solution 
    (Currently, I am using version 0.25.2 to avoid this problem, but it may introduce new errors.)
    Not found yet.
    What does that error mean?
    It means the tcp port 8443 on minikube's new created vm could not be opened.
    you could login the created minikube vm using =minikube ssh=, then check the status, you will found that the tcp 8443 port is not in listen status.
    
** About Pod Remains in ContainerCreating status
