kubernetes/tutorial.html

<div id="outline-container-org87a9a05" class="outline-2">
<h2 id="org87a9a05"><span class="section-number-2">6</span> Clean up</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org19c399d" class="outline-3">
<h3 id="org19c399d"><span class="section-number-3">6.1</span> Clean up kubernetes resources</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Delete service object
</p>
<div class="org-src-container">
<pre class="src src-sh">kubectl delete service &lt;service-name&gt;
</pre>
</div>

<p>
Delete pods, need to specify the controller type
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If it is a ReplicationController</span>
kubectl delete rc hello-node

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If it is deployment controller</span>
kubectl delete deployment hello-node
</pre>
</div>

<p>
Stop and delete minikube VM
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Stop minikube</span>
minikube stop 

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Delete minikube VM</span>
minikube delete
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad92772" class="outline-3">
<h3 id="orgad92772"><span class="section-number-3">6.2</span> Clean up docker</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">listing all running containers</span>
docker ps -a

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">getting additional information about a container </span>
docker inspect &lt;container-name&gt;

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">running a shell inside an existing container </span>
docker exec -it kubia-container bash

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">shot all container</span>
docker stop $(docker ps | awk <span style="color: #2d9574;">'{print $NF}'</span> | grep -v <span style="color: #2d9574;">'NAMES'</span>)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">delte all containers</span>
docker rm -v $(docker ps -aq)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">delete all docker images</span>
docker rmi $(docker images -q)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd0c887f" class="outline-2">
<h2 id="orgd0c887f"><span class="section-number-2">7</span> Troubleshooting</h2>
<div class="outline-text-2" id="text-7">
<p>
(encountered problems)
</p>
</div>
<div id="outline-container-org4ac4acb" class="outline-3">
<h3 id="org4ac4acb"><span class="section-number-3">7.1</span> About error shows need virtual box</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgc416234" class="outline-4">
<h4 id="orgc416234"><span class="section-number-4">7.1.1</span> Problem description</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Something like you need virtual box&#x2026;
</p>
</div>
</div>
<div id="outline-container-org79498f3" class="outline-4">
<h4 id="org79498f3"><span class="section-number-4">7.1.2</span> Solution</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
When run <code>minikube start</code>, specify <code>--vm-driver "hyperv"</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orge616ba9" class="outline-3">
<h3 id="orge616ba9"><span class="section-number-3">7.2</span> About error about network adaptor is not visible</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-orgb0f599c" class="outline-4">
<h4 id="orgb0f599c"><span class="section-number-4">7.2.1</span> Problem description</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
Error like network adaptor is not visible.
</p>
</div>
</div>
<div id="outline-container-org948d22c" class="outline-4">
<h4 id="org948d22c"><span class="section-number-4">7.2.2</span> Solution</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
Check if you created external virtual switch, and specify it with <code>--hyperv-virtual-switch "&lt;switch-name&gt;"</code> during start minikube.
</p>
</div>
</div>
</div>
<div id="outline-container-orged0b6b0" class="outline-3">
<h3 id="orged0b6b0"><span class="section-number-3">7.3</span> About hang at "minikube start"</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-org3f9b4a4" class="outline-4">
<h4 id="org3f9b4a4"><span class="section-number-4">7.3.1</span> Problem description</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
When I use the latest version of minikube, say 0.30.0, and run <code>minikube start</code>, it hangs at the stage:"start cluster components&#x2026;".
When run <code>minikube logs -v 9</code>, the log shows something like:
</p>
<div class="org-src-container">
<pre class="src src-sh">I1011 10:24:04.073426    2160 round_trippers.go:386] curl -k -v -XGET  -H <span style="color: #2d9574;">"User-Agent: minikube.exe/v0.0.0 (windows/amd64) kubernetes/$Format"</span> -H <span style="color: #2d9574;">"Accept: application/json, */*"</span> <span style="color: #2d9574;">'https://134.244.221.171:8443/api/v1/namespaces/kube-system/pods?labelSelector=k8s-app%3Dkube-proxy'</span>
                                                     I1011 10:24:05.073974    2160 round_trippers.go:405] GET https://134.244.221.171:8443/api/v1/namespaces/kube-system/pods?<span style="color: #7590db;">labelSelector</span>=k8s-app%3Dkube-proxy <span style="color: #4f97d7; font-weight: bold;"> in</span> 1002 milliseconds
                                                                                                          I1011 10:24:05.073974    2160 round_trippers.go:411] Response Headers:
                                                                                                                                                               I1011 10:24:05.075960    2160 kubernetes.go:119] error getting Pods with label selector <span style="color: #2d9574;">"k8s-app=kube-proxy"</span> [Get https://134.244.221.171:8443/api/v1/namespaces/kube-system/pods?<span style="color: #7590db;">labelSelector</span>=k8s-app%3Dkube-proxy: dial tcp 134.244.221.171:8443: connectex: No connection could be nmade because the target machine actively refused it.]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe0fb9d" class="outline-4">
<h4 id="orgbe0fb9d"><span class="section-number-4">7.3.2</span> solution</h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
(Currently, I am using version 0.25.2 to avoid this problem, but it may introduce new errors.)
Not found yet.
What does that error mean?
It means the tcp port 8443 on minikube's new created vm could not be opened.
you could login the created minikube vm using <code>minikube ssh</code>, then check the status, you will found that the tcp 8443 port is not in listen status.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd445822" class="outline-3">
<h3 id="orgd445822"><span class="section-number-3">7.4</span> About Pod Remains in ContainerCreating status</h3>
<div class="outline-text-3" id="text-7-4">
</div>
