kubernetes/tutorial.org
*** Problem description
    The problem is the pod's status is stuck in "ContainerCreating".
    #+begin_src sh
      PS C:\windows\system32> kubectl get pods
      NAME                                      READY     STATUS              RESTARTS   AGE
      hello-node-7n5qv                          0/1       ContainerCreating   0          37m
      hello-node-development-548b8c445d-j9h6r   0/1       ContainerCreating   0          17m
    #+end_src
    Check the details =kubectl describe pod <the stuck pod's name>= about this pod shows:
    #+begin_src sh
      Events:
      Type     Reason                  Age                From               Message
      ----     ------                  ----               ----               -------
      Normal   Scheduled               32m                default-scheduler  Successfully assigned hello-node-cv26p to minikube
      Normal   SuccessfulMountVolume   32m                kubelet, minikube  MountVolume.SetUp succeeded for volume "default-token-tnsgs"
      Warning  FailedCreatePodSandBox  2m (x64 over 32m)  kubelet, minikube  Failed create pod sandbox.
    #+end_src

    Check the log of the pod
    #+begin_src sh
      # check the logs of the current container
      kubectl logs ${POD_NAME} ${CONTAINER_NAME}

      # if your container has previously crashed, you can access the previous container's crash log with
      kubectl logs --previous ${POD_NAME} ${CONTAINER_NAME}

      # Alternately, you can run commands inside that container with exec
      kubectl exec ${POD_NAME} -c ${CONTAINER_NAME} -- ${CMD} ${ARG1} ${ARG2} ... ${ARGN}
    #+end_src
    Note: =-c ${CONTAINER_NAME}= is optional and can be ommitted if the pod contains a single container.

    The log shows:
    #+begin_src sh
      google_containers/pause-amd64:3.0": Error response from daemon: Get https://gcr.io/v2/: net/http: request canceled while waiting for connection (Client.Timeout exceeded while awaiting headers)
      Oct 17 01:54:41 minikube localkube[3349]: E1017 01:54:41.827656    3349 pod_workers.go:186] Error syncing pod c4c3188325a93a2d7fb1714e1abf1259 ("kube-addon-manager-minikube_kube-system(c4c3188325a93a2d7fb1714e1abf1259)"), skipping: failed to "CreatePodSandbox" for "kube-addon-manager-minikube_kube-system(c4c3188325a93a2d7fb1714e1abf1259)" with CreatePodSandboxError: "CreatePodSandbox for pod \"kube-addon-manager-minikube_kube-system(c4c3188325a93a2d7fb1714e1abf1259)\" failed: rpc error: code = Unknown desc = failed pulling image \"gcr.io/google_containers/pause-amd64:3.0\": Error response from daemon: Get https://gcr.io/v2/: net/http: request canceled while waiting for connection (Client.Timeout exceeded while awaiting headers)"
    #+end_src

*** Exlaination
    Except your image, when the container is created, it also needs =gcr.io/google_containers/pause-amd64:3.0= as [[https://stackoverflow.com/questions/46630377/what-is-pod-infra-container-image-meant-for][as =--pod-infra-container=]].
*** Solution one
    Seems the only option for using =kubectl= is to get around GFW.
    (Have not found yet)
    
    Some related links
    1) [[https://github.com/kubernetes/kubernetes/issues/7090][Why pull from "gcr.io" registry when I create pod?]]

*** Solution two
    If you are using =kubelet=, Specify the pod-infra option
    #+begin_src sh
      kubelet --pod-infra-container-image="docker.io/kubernetes/pause"
    #+end_src

    Since, we are using minikube, we could specify extra-config as
    #+begin_src sh
      minikube start --vm-driver "hyperv" --hyperv-virtual-switch "minikube-switch" --memory 4096 --extra-config=kubelet.pod-infra-container-image=registry.aliyuncs.com/archon/pause-amd64:3.0
    #+end_src
    (But, currently it doesn't work)
         
    We could also build those common images from Dockerfile:
    Create [[https://github.com/kubernetes/kubernetes/blob/master/build/pause/Dockerfile][Dockerfile]]
    #+begin_src dockerfile
	      # Copyright 2016 The Kubernetes Authors.
	      #
	      # Licensed under the Apache License, Version 2.0 (the "License");
	      # you may not use this file except in compliance with the License.
	      # You may obtain a copy of the License at
	      #
	      #     http://www.apache.org/licenses/LICENSE-2.0
	      #
	      # Unless required by applicable law or agreed to in writing, software
	      # distributed under the License is distributed on an "AS IS" BASIS,
	      # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
	      # See the License for the specific language governing permissions and
	      # limitations under the License.

	      FROM scratch
	      ARG ARCH
	      ADD bin/pause-${ARCH} /pause
	      ENTRYPOINT ["/pause"]
    #+end_src
    Build docker image and specify to use it when use kubelete


