kubernetes/tutorial.html
<div id="outline-container-org58203ec" class="outline-4">
<h4 id="org58203ec"><span class="section-number-4">7.4.1</span> Problem description</h4>
<div class="outline-text-4" id="text-7-4-1">
<p>
The problem is the pod's status is stuck in "ContainerCreating".
</p>
<div class="org-src-container">
<pre class="src src-sh">PS C:\windows\system32&gt; kubectl get pods
NAME                                      READY     STATUS              RESTARTS   AGE
hello-node-7n5qv                          0/1       ContainerCreating   0          37m
hello-node-development-548b8c445d-j9h6r   0/1       ContainerCreating   0          17m
</pre>
</div>
<p>
Check the details <code>kubectl describe pod &lt;the stuck pod's name&gt;</code> about this pod shows:
</p>
<div class="org-src-container">
<pre class="src src-sh">Events:
Type     Reason                  Age                From               Message
----     ------                  ----               ----               -------
Normal   Scheduled               32m                default-scheduler  Successfully assigned hello-node-cv26p to minikube
Normal   SuccessfulMountVolume   32m                kubelet, minikube  MountVolume.SetUp succeeded for volume <span style="color: #2d9574;">"default-token-tnsgs"</span>
Warning  FailedCreatePodSandBox  2m (x64 over 32m)  kubelet, minikube  Failed create pod sandbox.
</pre>
</div>

<p>
Check the log of the pod
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">check the logs of the current container</span>
kubectl logs ${<span style="color: #7590db;">POD_NAME</span>} ${<span style="color: #7590db;">CONTAINER_NAME</span>}

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if your container has previously crashed, you can access the previous container's crash log with</span>
kubectl logs --previous ${<span style="color: #7590db;">POD_NAME</span>} ${<span style="color: #7590db;">CONTAINER_NAME</span>}

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Alternately, you can run commands inside that container with exec</span>
kubectl exec ${<span style="color: #7590db;">POD_NAME</span>} -c ${<span style="color: #7590db;">CONTAINER_NAME</span>} -- ${<span style="color: #7590db;">CMD</span>} ${<span style="color: #7590db;">ARG1</span>} ${<span style="color: #7590db;">ARG2</span>} ... ${<span style="color: #7590db;">ARGN</span>}
</pre>
</div>
<p>
Note: <code>-c ${CONTAINER_NAME}</code> is optional and can be ommitted if the pod contains a single container.
</p>

<p>
The log shows:
</p>
<div class="org-src-container">
<pre class="src src-sh">google_containers/pause-amd64:3.0<span style="color: #2d9574;">": Error response from daemon: Get https://gcr.io/v2/: net/http: request canceled while waiting for connection (Client.Timeout exceeded while awaiting headers)</span>
<span style="color: #2d9574;">Oct 17 01:54:41 minikube localkube[3349]: E1017 01:54:41.827656    3349 pod_workers.go:186] Error syncing pod c4c3188325a93a2d7fb1714e1abf1259 ("</span>kube-addon-manager-minikube_kube-system(c4c3188325a93a2d7fb1714e1abf1259)<span style="color: #2d9574;">"), skipping: failed to "</span>CreatePodSandbox<span style="color: #2d9574;">" for "</span>kube-addon-manager-minikube_kube-system(c4c3188325a93a2d7fb1714e1abf1259)<span style="color: #2d9574;">" with CreatePodSandboxError: "</span>CreatePodSandbox for pod <span style="color: #2d9574;">\"</span>kube-addon-manager-minikube_kube-system(c4c3188325a93a2d7fb1714e1abf1259)<span style="color: #2d9574;">\"</span> failed: rpc error: code = Unknown desc = failed pulling image <span style="color: #2d9574;">\"</span>gcr.io/google_containers/pause-amd64:3.0<span style="color: #2d9574;">\"</span>: Error response from daemon: Get https://gcr.io/v2/: net/http: request canceled while waiting for connection (Client.Timeout exceeded while awaiting headers)<span style="color: #2d9574;">"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e75473" class="outline-4">
<h4 id="org1e75473"><span class="section-number-4">7.4.2</span> Exlaination</h4>
<div class="outline-text-4" id="text-7-4-2">
<p>
Except your image, when the container is created, it also needs <code>gcr.io/google_containers/pause-amd64:3.0</code> as <a href="https://stackoverflow.com/questions/46630377/what-is-pod-infra-container-image-meant-for">as <code>--pod-infra-container</code></a>.
</p>
</div>
</div>
<div id="outline-container-org4039409" class="outline-4">
<h4 id="org4039409"><span class="section-number-4">7.4.3</span> Solution one</h4>
<div class="outline-text-4" id="text-7-4-3">
<p>
Seems the only option for using <code>kubectl</code> is to get around GFW.
(Have not found yet)
</p>

<p>
Some related links
</p>
<ol class="org-ol">
<li><a href="https://github.com/kubernetes/kubernetes/issues/7090">Why pull from "gcr.io" registry when I create pod?</a></li>
</ol>
</div>
</div>

<div id="outline-container-org2dbe8c5" class="outline-4">
<h4 id="org2dbe8c5"><span class="section-number-4">7.4.4</span> Solution two</h4>
<div class="outline-text-4" id="text-7-4-4">
<p>
If you are using <code>kubelet</code>, Specify the pod-infra option
</p>
<div class="org-src-container">
<pre class="src src-sh">kubelet --pod-infra-container-image=<span style="color: #2d9574;">"docker.io/kubernetes/pause"</span>
</pre>
</div>

<p>
Since, we are using minikube, we could specify extra-config as
</p>
<div class="org-src-container">
<pre class="src src-sh">minikube start --vm-driver <span style="color: #2d9574;">"hyperv"</span> --hyperv-virtual-switch <span style="color: #2d9574;">"minikube-switch"</span> --memory 4096 --extra-config=kubelet.pod-infra-container-image=registry.aliyuncs.com/archon/pause-amd64:3.0
</pre>
</div>
<p>
(But, currently it doesn't work)
</p>

<p>
We could also build those common images from Dockerfile:
Create <a href="https://github.com/kubernetes/kubernetes/blob/master/build/pause/Dockerfile">Dockerfile</a>
</p>
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Copyright 2016 The Kubernetes Authors.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Licensed under the Apache License, Version 2.0 (the "License");</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">you may not use this file except in compliance with the License.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">You may obtain a copy of the License at</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">http://www.apache.org/licenses/LICENSE-2.0</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Unless required by applicable law or agreed to in writing, software</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">distributed under the License is distributed on an "AS IS" BASIS,</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">See the License for the specific language governing permissions and</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">limitations under the License.</span>

<span style="color: #4f97d7; font-weight: bold;">FROM</span> <span style="color: #ce537a; font-weight: bold;">scratch</span>
<span style="color: #4f97d7; font-weight: bold;">ARG</span> ARCH
<span style="color: #4f97d7; font-weight: bold;">ADD</span> bin/pause-${<span style="color: #7590db;">ARCH</span>} /pause
<span style="color: #4f97d7; font-weight: bold;">ENTRYPOINT</span> [<span style="color: #2d9574;">"/pause"</span>]
</pre>
</div>
<p>
Build docker image and specify to use it when use kubelete
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-10-18 Thu 13:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
